Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/svd/PIC32CX5109BZ31048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DAC_CTRL</name>
         <version>05063A.3 Draft</version>
         <description>Descriptive Title of Macro</description>
         <baseAddress>0x44003C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DACCON</name>
               <description>CONTROL Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPRCEN1</name>
                     <description>LPRC clock enabled for SnH mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPRCEN1Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>LPRC clock not enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>LPRC clock enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTEN</name>
                     <description>Will enable the output buffer</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OUTENSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Output buffer disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Output buffer enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SNH</name>
                     <description>Sample and hold circuitry</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SNHSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DAC operation in normal mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DAC operation in low power mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The peripheral is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The peripheral is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACCODE</name>
               <description>DAC CODE Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DAC data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACCON2</name>
               <description>DAC Config register1</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WIDTH</name>
                     <description>SnH clock width</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>PERIOD</name>
                     <description>SnH clock period</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>PRESCALAR</name>
                     <description>Prescaling factor for SnH clock</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>DGI_SPI</name>
         <version>043660.1 Draft</version>
         <description>SPI DMA for DGI Macro</description>
         <baseAddress>0x44003E00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x54</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DGI_SPI</name>
            <value>39</value>
         </interrupt>
         <registers>
            <register>
               <name>SPICON</name>
               <description>SPI control register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GO</name>
                     <description>DMA Operation Status bitThis bit is set by the user software to start the DMA operation. It is reset back to zero by the DMA engine whenthe DMA operation is completed or aborted by clearing the ON bit.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>GOSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA is not in operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA is in operation</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STXISEL</name>
                     <description>SPI Transmit Service Request Interrupt SelectFor enhanced buffer mode, the SPI generates a Transmit Service Request when:</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>STXISELSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The SPIxTXB is empty and SPIxSR is empty (i.e. all transmit operations are complete)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The SPIxTXB is empty</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>The SPIxTXB is at least half empty</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>The SPIxTXB is not full</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKP</name>
                     <description>Clock Polarity Select bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CKPSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Idle state for clock is a low level; active state is a high level</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Idle state for clock is a high level; active state is a low level</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SSCON</name>
                     <description>SSControl bits</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SSCONSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SS is not controlled by the DMA module</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SS is asserted for the duration of TXCNT</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKE</name>
                     <description>SPI Clock Edge Select bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CKESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Transmit happens on transition from idle clock state to active clock stat e</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Transmit happens on transition from active clock state to idle clock state</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Serial Word Length bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DISSDO</name>
                     <description>Disable SDO bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DISSDOSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SDO pin is controlled by the macro</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SDO pin is not used by the macro. Pin controlled by PORT function</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIDL</name>
                     <description>Stop in Idle control bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIDLSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Continue to operate in CPU Idle mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Halt in CPU Idle mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Freeze bit (in Debug Mode)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FRZSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Continue macro operation when in Debug mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Break macro operation when in Debug mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ON</name>
                     <description>DGISPI On bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ONSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Turn off and reset macro, disable clocks, disable interrupt event generation, allow SFR modifications.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable macro</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENHBUF</name>
                     <description>Enhanced Buffer Enable bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENHBUFSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Enhanced Buffer Mode is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enhanced Buffer Mode is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MCLKEN</name>
                     <description>Master Clock Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MCLKENSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PBCLK is used by the BRG</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>MCLK is used by the BRG</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MSSEN</name>
                     <description>Master Mode Slave Select Enable bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MSSENSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Slave select SPI support disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SPI Slave Select support enabled </description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPISTAT</name>
               <description>SPI Status register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000008</resetValue>
               <fields>
                  <field>
                     <name>SPITBF</name>
                     <description>SPI Transmit Buffer Full Status bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPITBFSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SPIxTXB not full</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SPIxTXB is full</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPITBE</name>
                     <description>SPI Transmit Buffer Empty status bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPITBESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SPIxTXB is not empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SPIxTXB is empty</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRMT</name>
                     <description>Shift Register (SPIxSR) Empty bit0= There are current or pending transactions</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRMTSelect</name>
                        <enumeratedValue>
                           <name>1</name>
                           <description>There are no current or pending transactions</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPIBUSY</name>
                     <description>SPI activity status bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPIBUSYSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No on-going transactions (at time of read)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Macro currently busy with some transactions</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXBUFELM</name>
                     <description>TransmitBuffer Element Count bits (valid only when ENHBUF = 1)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPIBUF</name>
               <description>SPI BUFFER register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>FIFO Data bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
