Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/svd/PIC32CX5109BZ31048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ROT</name>
         <version>04599Rev A.1</version>
         <description>Secure Root of Trust Macro</description>
         <baseAddress>0x44002C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC0C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SECCFG</name>
               <description>Secure Configuration HOLDING REGISTER1,2</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UUID_LCK</name>
                     <description>Programming lock bits for Unique ID fuses</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>UUID_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Unique ID is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DEBUG_LCK</name>
                     <description>Lock bits for debug/programming</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DEBUG_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Debug is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Debug is locked</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Debug is locked</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Debug is locked</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROOT_KEY_LCK</name>
                     <description>Lock bits for storage root Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ROOT_KEY_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Storage root key is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOT_KEY_LCK</name>
                     <description>Lock bits for Secure Boot/OTA Key</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BOOT_KEY_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Secure boot key is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADD_BOOT_KEY</name>
                     <description>Additional boot Key bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SEC_BOOT</name>
               <description>Secure Boot Register</description>
               <addressOffset>0xC00</addressOffset>
               <size>32</size>
               <resetValue>0x00010002</resetValue>
               <fields>
                  <field>
                     <name>SEC_BOOT_REQD</name>
                     <description>Bits to indicate that secure boot is required on the next device reset.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SEC_BOOT_REQDSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>S ecure boot code authentication is required</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>S ecure boot code authentication is NOT required</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>S ecure boot code authentication is NOT required</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>S ecure boot code authentication is required</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEC_BOOT_STATUS</name>
                     <description>Bits to indicate that secure boot status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SEC_BOOT_DONE</name>
                     <description>Bits to indicate that secure boot is done</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SEC_BOOT_DONESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>S ecure boot is done</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>S ecure boot is not done</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>S ecure boot is not done</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>S ecure boot is done</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFUSE_RWDATA</name>
               <description>EFuse RW Data Register</description>
               <addressOffset>0xC04</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>eFuse Program (Write) Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ADDR</name>
                     <description>eFuse Program/Read Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFUSE_CON</name>
               <description>Efuse Configuration Register2</description>
               <addressOffset>0xC08</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PGM_1BIT</name>
                     <description>eFuse CTRL to program 1 bit at a time. Valid only when EN_PGM is set</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PGM_1BITSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>EFuse controller will program EFUSE_RWDATA.DATA[15:0] to the address in EFUSE_RWDATA.ADDR[11:3]</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>EFuse controller will program EFUSE_RWDATA.DATA[0] to the address in EFUSE_RWDATA.ADDR[11:0]</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PGM_MODE</name>
                     <description>eFuse Programming Mode Enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PGM_MODESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>EFuse Programming disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>EFuse Programming enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_LD</name>
                     <description>eFuse Word Read Start bit for loading the fuse byte pointed by ADDR field into the holding register</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EN_LDSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>EFuse Read operation has completed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Start eFuse Read operation for specified eFuse word as addressed in EFUSE_RWDATA register</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_LD_ALL1</name>
                     <description>eFuse Panel Read Start bit for loading into the holding registers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EN_LD_ALL1Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>EFuse Read operation has completed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Start eFuse Read operation for entire eFuse panel</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_PGM</name>
                     <description>eFuse Programming Start bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EN_PGMSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>EFuse Programming operation has completed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Start eFuse Programming operation</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
